// Задача №6

Console.WriteLine("Введите число: ");
var number = Convert.ToInt64(Console.ReadLine());

if(number % 2 == 0)
{
    Console.WriteLine("Число чётное");
}
else
{
    Console.WriteLine("Число нечетное");
}